'number' + 3 + 3 // відповідь number33 конкатенации
null + 3 // відповідь 3,бо null це 0 
5 && "qwerty" // відвовідь qwerty ,&& - логическое И видає перше False зліва направо, тут такого нема , тому відповідь останнє що він перевірив
+'40' + +'2' + "hillel" // 42hillel ,  + унарний плюс змінює строку ʼ40ʼ на число 40 , додає по такому ж принципу 2 в потім знов конкатенація
'10' - 5 === 6; // False , рядок 10 буде числом 10, 10-5 буде 5 , а === це строге порівнянні
true + false // 1 - бо true це 1 а  false 0
'4px' - 3 // NaN ,бо рядок 4рх не може бути числом тому це NaN -3 а відвіподі NaN
'4' - 3 // відповідь 1 ,бо рядок 4 стане числом 4
'6' + 3 ** 0// буде "61" , бо 3 в ступіні 0 це 1, а далі конкатенація
12 / '6' // 2, бо при діленні рядок 6 стане цифрою 6
'10' + (5 === 6); // "10False", бо 10 це рядок, + значит буде конкатенація, а 5 не равно 6
null == '' // False, бо  між скобками є пробіл в рядку, а null це 0
3 ** (9 / 3);//  27, бо спочатку в скобках дія 9:3 а потім 3 в ступінь 3
!!'false' == !!'true'//  бо !! приводить до булевого значення рядки, вони обидва будуть тру бо там є вміст 
0 || '0' && 1 // 0 бо це перше фолс значення зліва направо
(+null == false) < 1; // False ,спочатку в скобках, унарний плюс робить нал 0, нестроге прирівнюівання дорівнює фолс, туму в скобках буде тру. але тру це 1 , а вона не меньше 1
false && true || true // true ,спочатку робимо логичне і и він зупиниться на фолс, потім або і він між фолс и тру повинен видати перше вірне значення
false && (false || true); // fals спочатку в скобках і відповідь тру, потім логічне і і видать першу помілку фолс
(+null == false) < 1 ** 5; // False,  спочатку в скобках і унарний плюс робить нал 0 і він дорівнюється fals, тому результат в кобках тру. 1 в ступіні 5 це 1, але 1 не меньше 1 тому відповідь фолс